[
  {
    "amendment_id": "A-001",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2025-01-26T19:00:00Z",
    "type": "new_principle",
    "proposal": "Article II, Section 2.4 — Regression Override Protocol: When any specialist identifies loss of previously acquired developmental or functional skills (motor, language, cognitive, or adaptive), the following are mandatory: (a) Any prior neurodevelopmental diagnosis (including ASD, intellectual disability, or ADHD) must be formally re-evaluated against the regression evidence and cannot be accepted as sufficient explanation without explicit justification; (b) The differential must include at least two neurodegenerative or neurometabolic conditions, with specific testing recommendations; (c) The case must be flagged as 'regression-positive' in the shared case record, triggering the Observer to monitor for anchoring on the prior diagnosis. Regression is defined as documented loss of a skill the patient previously demonstrated reliably, not failure to acquire new skills.",
    "rationale": "The central failure in this case was that developmental regression — a cardinal red flag incompatible with ASD — was repeatedly reinterpreted through the ASD lens ('behavioral regression due to anxiety,' 'regression can happen on the spectrum'). Eight providers across 10 years accepted the ASD label despite mounting evidence of skill loss. No current constitutional principle specifically addresses how to handle regression in the context of an existing neurodevelopmental diagnosis. Article 2.1 (Bias Awareness) is too general to prevent this specific failure mode — providers need a concrete protocol that forces re-evaluation when regression is present.",
    "evidence_from_case": "Eli lost buttoning ability between ages 4-6, progressed from walking to AFOs to wheelchair, regressed from short sentences to single words to near-silence — yet every provider from age 3.5 to age 13 accepted ASD as the primary diagnosis. The school psychologist stated 'regression can happen' in ASD. The second pediatrician 'accepted the ASD diagnosis' from prior records. The neurologist at age 6 'noted autism diagnosis in chart' and did not investigate regression etiology. The developmental pediatrician's Round 1 analysis demonstrated this trajectory is 'INCOMPATIBLE WITH ASD' — a determination that took 10 years in the real clinical timeline.",
    "affected_section": "Article II: Cognitive Safety (new Section 2.4)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-002",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2025-01-26T19:00:00Z",
    "type": "new_principle",
    "proposal": "Article I, Section 1.5 — Discriminative Evidence Requirement: When a specialist cites evidence in support of a hypothesis, they MUST classify each piece of evidence as either (a) DISCRIMINATING — favors this hypothesis over at least one named competing hypothesis, with explanation of why — or (b) SHARED — consistent with this hypothesis but equally consistent with one or more competing hypotheses. A hypothesis supported entirely by SHARED evidence cannot be assigned confidence above 0.50. The Observer shall flag any analysis where >75% of cited evidence is classified as SHARED while confidence exceeds 0.50.",
    "rationale": "In Round 1, the neurologist cited 10 evidence points in support of mitochondrial disease, but the Round 1 Observer identified that nearly all of them (scoliosis, nocturnal episodes, seizures, regression) were equally consistent with NCL, PLA2G6, and other neurodegenerative conditions. Each piece was interpreted through a mitochondrial lens rather than evaluated for discriminative value. This confirmation bias was only corrected in Round 2 after Observer intervention. A structural requirement to classify evidence as discriminating vs. shared would have forced this analysis in Round 1 and prevented the 2-of-3 anchoring on mitochondrial disease that the Observer flagged as a bandwagon risk.",
    "evidence_from_case": "Round 1 Observer flagged: 'Scoliosis is described as a recognized complication of mitochondrial myopathy — while true, scoliosis is equally or more characteristic of NCL, PLA2G6, and multiple other progressive neurodegenerative conditions.' The neurologist's Round 2 re-analysis demonstrated that the cerebellar-predominant MRI pattern was actually a discriminating finding AGAINST mitochondrial disease and FOR NCL/PLA2G6 — a distinction that existed in Round 1 data but was not recognized because evidence was marshaled for compatibility rather than discrimination.",
    "affected_section": "Article I: Diagnostic Integrity (new Section 1.5)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-003",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2025-01-26T19:00:00Z",
    "type": "new_principle",
    "proposal": "Article I, Section 1.6 — Longitudinal Data Synthesis Mandate: Before independent specialist analysis begins, the institution must produce a unified longitudinal timeline that includes: (a) All serial studies of the same type explicitly compared (e.g., MRI-to-MRI, growth parameters over time); (b) A developmental trajectory graph plotting skill acquisition and loss against chronological age; (c) A complete medication and diagnosis history showing when each label was applied and by whom. This timeline must be generated by a designated Records Integration function and provided to all specialists as part of the case intake. No specialist may begin analysis without access to the unified timeline. When records are fragmented across providers or systems, this must be flagged as a data integrity risk.",
    "rationale": "The most devastating systemic failure in this case was records fragmentation. No single provider ever had access to all 4 MRI scans, the EEG, the elevated lactate, AND the full developmental timeline simultaneously. The progressive cerebellar atrophy was not identified until age 9 because the age-3 and age-6 MRIs were at different hospitals and had never been compared. The EEG results and genetics referral were lost in an incomplete records transfer. The case record explicitly states: 'The mother's paper binder was more complete than any hospital's electronic record.' The current constitution requires evidence-based reasoning (1.2) but does not address the upstream problem of ensuring all evidence is assembled and synthesized before reasoning begins.",
    "evidence_from_case": "Four MRIs across four institutions were never compared until age 9, delaying detection of progressive cerebellar atrophy by at least 3 years. The age-6 MRI was read as 'normal variant' in isolation but showed 'mildly prominent ventricles' that, compared to the normal age-3 MRI, represented early atrophy. The EEG and genetic workup recommendation from Neurologist #2 were lost in the records transfer to the third state. Neurologist #3 'ordered new MRI, repeated some tests, unaware of prior lactate finding.' The complete record summary states: 'No single provider ever had access to all 4 MRI scans, the EEG, the elevated lactate, AND the full developmental timeline simultaneously.'",
    "affected_section": "Article I: Diagnostic Integrity (new Section 1.6)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-004",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2025-01-26T19:00:00Z",
    "type": "modify_principle",
    "proposal": "Article III, Section 3.1 — Don't-Miss Diagnoses (amended): Every case must explicitly address life-threatening diagnoses that could present similarly, even if deemed unlikely. Additionally, TREATABLE conditions within the differential must be flagged with a 'TREATABLE — URGENT' label and prioritized for immediate testing regardless of their ranked probability. When a treatable condition exists anywhere in the differential, the recommended next steps must include the specific diagnostic test to confirm or exclude it as the FIRST listed action item. The rationale: a treatable condition at 5% probability may warrant more urgent investigation than a non-treatable condition at 40% probability, because the expected value of early diagnosis is determined by probability × treatability × time-sensitivity, not probability alone.",
    "rationale": "The final diagnosis identified CLN2 (TPP1 deficiency, with available enzyme replacement therapy) and CoQ10 deficiency as treatable conditions within the differential — but these were only surfaced in the synthesis phase. Neither was highlighted with urgency commensurate with their treatability during the debate rounds. In the real clinical timeline, the genetics referral had a 4-month wait, then insurance denial, then appeal — totaling over a year of delay. A constitutional principle that forces treatable diagnoses to the front of the workup queue, regardless of probability ranking, would prevent the institution from inadvertently replicating the clinical system's failure to prioritize actionable diagnoses.",
    "evidence_from_case": "Final diagnosis lists CLN2/TPP1 as probability 0.07 but flags it 'URGENT treatable diagnosis with available enzyme replacement therapy (cerliponase alfa/Brineura); rapid, inexpensive test that should not await WES.' CoQ10 deficiency at 0.08 probability is flagged as 'URGENT treatable diagnosis.' In the clinical timeline, genetic testing was recommended at age 9 but not completed until age 13 — a 4-year delay during which the child progressed from walking with orthotics to wheelchair dependence. The institution's recommended next steps correctly prioritize these, but no constitutional principle required this prioritization — it emerged ad hoc from the geneticist's clinical judgment rather than from institutional policy.",
    "affected_section": "Article III: Patient Safety (modify Section 3.1)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-005",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2025-01-26T19:00:00Z",
    "type": "modify_principle",
    "proposal": "Article II, Section 2.3 — Premature Convergence Prevention (amended): If all specialists agree on a primary diagnosis in Round 1, the Observer MUST challenge the consensus and force consideration of alternatives. ADDITIONALLY: If Round 2 produces unanimous convergence on a NEW leading hypothesis that was not the majority position in Round 1, the Observer must (a) document the specific evidence that drove each specialist's shift, distinguishing independent re-analysis from deference to another specialist's domain authority; (b) require at least one specialist to formally steelman the strongest hypothesis that was abandoned in the shift, documenting what specific new evidence would be needed to restore it as the leading candidate; and (c) reduce the independence score by a minimum of 0.15 when unanimous convergence occurs in Round 2, to ensure the synthesis phase accounts for reduced epistemic diversity. The final synthesis must report the pre-convergence differential alongside the post-convergence differential.",
    "rationale": "In Round 2, all three specialists converged on NCL (CLN5/CLN6) as the leading hypothesis after the geneticist's MRI-pattern argument, shifting from a 2-1 split favoring mitochondrial disease in Round 1. The Round 2 Observer appropriately flagged this as a bandwagon risk (independence score dropped from 0.82 to 0.55) and noted the developmental pediatrician's endorsement of the MRI argument was 'largely deferential to the geneticist's domain authority rather than independently derived.' While the convergence may have been correct, the current Article 2.3 only addresses Round 1 convergence. The system needs safeguards for Round 2 convergence shifts, which may represent genuine learning OR social influence — and the institution cannot reliably distinguish between these without structural countermeasures.",
    "evidence_from_case": "Round 2 Observer: 'All three specialists now share an essentially identical diagnostic ranking: (1) NCL CLN5/CLN6, (2) PLA2G6, (3) mitochondrial/CoQ10. This degree of convergence on identical ordering warrants scrutiny.' Independence score dropped from 0.82 (Round 1) to 0.55 (Round 2). The Observer noted the developmental pediatrician's shift 'closely mirrors the neurologist's, producing a 3-of-3 consensus on NCL that did not exist in Round 1' and that the developmental pediatrician's 'endorsement of the MRI-pattern argument is largely deferential to the geneticist's domain authority rather than independently derived.' The neurologist's confidence swung from 0.72 mitochondrial to ranking it third — a magnitude of shift the Observer described as 'notable.'",
    "affected_section": "Article II: Cognitive Safety (modify Section 2.3)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-006",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2025-01-26T19:00:00Z",
    "type": "new_principle",
    "proposal": "Article I, Section 1.7 — Prior Diagnosis Skepticism Protocol: When a case presents with a previously assigned diagnosis, each specialist MUST independently evaluate whether the existing diagnosis is supported by the complete evidentiary record, rather than accepting it as a given. Specifically: (a) The prior diagnosis must be treated as a hypothesis to be tested, not a fact to be incorporated; (b) Each specialist must identify at least one finding in the record that is atypical or unexplained by the prior diagnosis; (c) If a prior diagnosis was assigned by a provider who had access to only a subset of the currently available data, this must be flagged as a 'partial-data diagnosis' and subjected to heightened scrutiny. The Observer shall flag any specialist analysis that incorporates a prior diagnosis without independent re-evaluation.",
    "rationale": "The ASD diagnosis assigned at age 3.5 was based on limited speech, repetitive hand movements, and social withdrawal — features that were genuinely present but were manifestations of a neurodegenerative process, not autism. Every subsequent provider inherited this label and filtered new evidence through it. The case demonstrates that prior diagnoses create a particularly insidious form of anchoring because they carry institutional authority — they are not the specialist's own hypothesis but an inherited conclusion that feels settled. The current constitution addresses anchoring generally (Article 2.1) but does not specifically address the unique danger of inherited diagnoses from prior providers, which carry implicit social proof.",
    "evidence_from_case": "The ASD diagnosis at age 3.5 was made by one developmental pediatrician based on behavioral observations, without EEG, metabolic workup, or genetic testing. Every subsequent provider (7 more across 10 years) accepted this label: the new pediatrician 'accepted ASD diagnosis,' the neurologist at age 6 'noted autism diagnosis in chart,' the school psychologist said 'He's on the spectrum, regression can happen,' and the ABA therapist recommended 'more intensive therapy' rather than questioning the diagnosis. The case explicitly states: 'The ASD diagnosis anchored all subsequent providers.' It was not until age 13 — a full decade later — that a geneticist 'formally questioned whether the original ASD diagnosis was correct at all.'",
    "affected_section": "Article I: Diagnostic Integrity (new Section 1.7)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-007",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2026-02-15T03:00:00Z",
    "type": "new_principle",
    "proposal": "Article I, Section 1.20 — Treatment Non-Response as Diagnostic Evidence: When the case record documents that a patient received evidence-based treatment for a diagnosed condition and the treatment produced NO improvement or WORSENING of the targeted outcomes despite adequate duration, intensity, and fidelity, this treatment non-response must be treated as DISCRIMINATING diagnostic evidence AGAINST the diagnosis being treated. The following are mandatory: (a) The Records Integration function must compile a 'TREATMENT RESPONSE MAP' listing each treatment received, the diagnosis it targeted, the duration and intensity of treatment, adherence/fidelity metrics, and the measured outcome trajectory (improvement, plateau, or decline); (b) For each treatment that produced plateau or decline, each specialist must evaluate whether the treatment was (i) ADEQUATE — evidence-based, delivered at appropriate dose/intensity for sufficient duration with documented fidelity, or (ii) INADEQUATE — insufficient dose, duration, intensity, or fidelity that could explain the poor response; (c) When an ADEQUATE treatment produces DECLINE in the targeted metric (not merely failure to improve, but active worsening of the condition the treatment addresses), this constitutes a 'PARADOXICAL TREATMENT RESPONSE' that is STRONG DISCRIMINATING evidence against the working diagnosis. The specialist must formally evaluate whether the wrong diagnosis — rather than treatment failure — is the parsimonious explanation; (d) When a paradoxical treatment response is documented by the treating clinician as unprecedented in their clinical experience (e.g., 'in 8 years treating 40+ ASD clients, I have never observed regression of this magnitude'), this clinical testimony must be treated as expert evidence equivalent in weight to a clinical study finding, not dismissed as anecdotal; (e) The Observer shall flag any specialist analysis that attributes a paradoxical treatment response to 'treatment resistance,' 'behavioral variability,' or 'motivational factors' without first formally evaluating whether the diagnosis itself is incorrect. This principle recognizes that treatment response is diagnostic data — a patient who worsens under evidence-based treatment for the diagnosed condition is providing information that the diagnosis may be wrong, and this information is systematically under-weighted relative to positive diagnostic findings.",
    "rationale": "The single most powerful early evidence against the ASD diagnosis in this case was the 14-month ABA therapy trajectory: 672 hours of intensive evidence-based intervention producing a 68.3% DECLINE in VB-MAPP scores — a paradoxical treatment response that BCBA Jennifer Mallory (8 years experience, 40+ ASD clients) and BCBA-D Amy Okonkwo (15 years, 150+ clients) stated was unprecedented. This was the clearest possible signal that the ASD diagnosis was wrong. The BCBA wrote THREE formal communications (December 2016, May 2017, July 2017 discharge summary) explicitly stating the regression was 'not consistent with typical ASD behavioral trajectories' and recommending comprehensive medical/neurological evaluation. Yet the medical system treated the therapy failure as a treatment problem rather than a diagnostic problem — the pediatrician attributed regression to 'ASD behavioral patterns or anxiety' and the neurologist attributed it to 'the natural history of ASD in the setting of moderate-severe intellectual disability.' No existing constitutional principle mandates that treatment non-response be evaluated as evidence AGAINST the diagnosis being treated. A-019 addresses rate-of-progression discordance for conditions with established natural histories, but this is a different failure mode: here, the discordance is between EXPECTED treatment response and OBSERVED treatment response, not between expected and observed disease progression. The distinction matters because treatment response data is uniquely actionable — a child who worsens under appropriate therapy cannot wait for imaging or genetic testing to prompt diagnostic re-evaluation.",
    "evidence_from_case": "VB-MAPP total score declined from 31.5 to 10.0 (68.3% decline) over 14 months of 25hr/week ABA therapy (672 total hours). BCBA documented this as unprecedented. Listener Responding declined from 5.0 to 1.0, Motor Imitation from 4.0 to 0.5, Visual Perceptual/Match from 5.5 to 1.5. Previously mastered skills (buttoning, color matching, body part identification, stair navigation) were lost. The BCBA explicitly stated: 'In our clinical experience with over 40 ASD clients, loss of previously acquired skills of this magnitude over a 6-month period is not consistent with typical ASD behavioral variability.' The BCBA-D with 15 years and 150+ clients concurred. Three formal communications were sent to the pediatrician. Despite this, the pediatrician's response at the 5-year well-child visit was: 'Some skill regression can occur in autism, particularly during periods of stress and transition.'",
    "affected_section": "Article I: Diagnostic Integrity (new Section 1.20)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-008",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2026-02-15T03:00:00Z",
    "type": "new_principle",
    "proposal": "Article III, Section 3.7 — Confirmed Diagnosis Continuity Verification: Before independent specialist analysis begins, the Records Integration function must determine whether a DEFINITIVE DIAGNOSIS has already been established at any prior institution, using the following hierarchy of diagnostic certainty: (a) BIOCHEMICALLY/PATHOLOGICALLY CONFIRMED — diagnosis confirmed by enzyme assay, biopsy, genetic sequencing, or other definitive laboratory test with >95% sensitivity and specificity (e.g., TPP1 enzyme deficiency for CLN2, hemoglobin electrophoresis for SCD, tissue biopsy for malignancy); (b) CLINICALLY ESTABLISHED — diagnosis made by an appropriate specialist based on validated diagnostic criteria with supporting investigations, but without a single definitive confirmatory test; (c) CLINICALLY SUSPECTED — diagnosis proposed but not yet confirmed, with workup incomplete or results pending. When a BIOCHEMICALLY/PATHOLOGICALLY CONFIRMED diagnosis is identified anywhere in the record — including in the patient/family's personal documentation, partially legible faxed records, or referenced-but-not-available reports — the following are mandatory: (i) This diagnosis must be flagged as 'CONFIRMED DIAGNOSIS — VERIFY CONTINUITY' and placed at the top of the case summary visible to all specialists BEFORE analysis begins; (ii) The Records Integration function must verify whether ALL current treating providers are aware of this confirmed diagnosis; if any current provider's notes do not reference the confirmed diagnosis, this must be flagged as a 'DIAGNOSTIC CONTINUITY FAILURE' — a critical patient safety finding; (iii) The institution's recommended next steps must include, as the FIRST action item: 'Verify that the confirmed diagnosis of [X] established at [institution] on [date] has been communicated to all current providers and is documented in the active problem list'; (iv) When the confirmed diagnosis has an available disease-modifying therapy, the diagnostic continuity failure must be flagged as 'TREATMENT-CRITICAL CONTINUITY FAILURE' with the specific therapy named and the estimated duration of potential treatment delay caused by the continuity failure. This principle addresses a failure mode distinct from all prior amendments: not a diagnostic reasoning error, but a DIAGNOSTIC INFORMATION TRANSFER error where a correct diagnosis is lost in the healthcare system and must be re-derived from scratch, potentially delaying treatment by years.",
    "rationale": "The most devastating systemic failure in this case was not the original misdiagnosis of ASD — it was the LOSS of the correct CLN2 diagnosis during a military PCS (Permanent Change of Station) from Georgia to North Carolina. Dr. Osei confirmed CLN2 disease with enzymatic evidence in April 2021. By June 2022, when the family arrived in North Carolina, the neurology records containing this confirmed diagnosis were not in the transferred file. The North Carolina PCP (Dr. Washington) documented: 'Neurology records: Dr. Adwoa Osei — NOT RECEIVED. EEG report — NOT RECEIVED. MRI brain report — NOT RECEIVED. Laboratory results including metabolic studies — NOT RECEIVED.' Despite multiple requests, the records remained incomplete for over a year. The neurology consultation in North Carolina (Dr. Park, September 2023) received Dr. Osei's notes only as 'partially legible fax — approximately 40% of text unreadable' with fragments reading '[unreadable]...genetic workup recommended...CLN or mitochondrial [unreadable]...family relocating...' Meanwhile, insurance denied genetic testing as 'not medically necessary,' adding months of delay. CLN2 disease has an FDA-approved enzyme replacement therapy (cerliponase alfa/Brineura, approved April 2017) that is most effective when started BEFORE significant neurological damage. Every month of diagnostic continuity failure is a month of lost therapeutic window. The mother's personal record binder — containing handwritten notes, printed lab results, and photographs — was more complete than any institutional medical record system. No existing constitutional principle addresses the specific failure mode of a CONFIRMED diagnosis being lost in records transfer.",
    "evidence_from_case": "TPP1 enzyme activity of 0.8 nmol/hr/mg confirmed CLN2 disease in April 2021 at Nationwide Children's Hospital. Dr. Osei's diagnosis discussion (June 2021) included referral to CLN2 treatment centers for cerliponase alfa evaluation. Family PCS'd to North Carolina. Transfer records did NOT include neurology records, EEG, MRI, or laboratory results. North Carolina PCP submitted three separate records requests. Partially legible fax received — '40% of text unreadable.' Mother's personal binder contained documentation of the confirmed diagnosis that was not available through any official records transfer channel. Dr. Park noted: 'This is the first time I have been able to review records spanning the patient's entire developmental and medical trajectory, thanks to the mother's personal documentation.' The confirmed diagnosis was effectively lost for 2+ years (April 2021 to September 2023 at earliest).",
    "affected_section": "Article III: Patient Safety (new Section 3.7)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-009",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2026-02-15T03:00:00Z",
    "type": "modify_principle",
    "proposal": "Article II, Section 2.3 — Premature Convergence Prevention (further amendment, adding to A-005): ADDITIONALLY: (e) PATHOGNOMONIC EVIDENCE CONVERGENCE EXCEPTION — When unanimous convergence in any round is anchored to a PATHOGNOMONIC test result (defined as a single test with documented sensitivity >95% AND specificity >95% for the target condition, performed at a certified reference laboratory, with the result independently consistent with the clinical phenotype), the standard convergence challenge protocol is MODIFIED as follows: (i) The Observer must verify that the pathognomonic result meets all four criteria (sensitivity, specificity, laboratory certification, clinical consistency) and explicitly document this verification; (ii) Rather than challenging the diagnosis itself, the mandatory challenge must focus on THREE alternative vectors: VERIFICATION — could the test result be erroneous (sample integrity, laboratory error, interfering substances)?; COMPLETENESS — are there any clinical features NOT explained by the confirmed diagnosis that might indicate dual pathology, a phenocopy, or a comorbid condition?; IMPLICATIONS — does the diagnosis have available disease-modifying therapy, and if so, what is the urgency of treatment initiation?; (iii) Specialists may assign confidence above 0.85 for a pathognomonic-anchored diagnosis without triggering overconfidence review, provided the pathognomonic verification criteria in (i) are met; (iv) The synthesis phase must explicitly state that convergence is anchored to a pathognomonic result and document the verification, completeness, and implications analyses. This exception prevents the institution from expending analytical resources challenging well-established biochemical diagnoses while preserving scrutiny for test validity, unexplained features, and treatment urgency — the dimensions where additional analysis has genuine clinical value.",
    "rationale": "The Round 1 Observer correctly flagged unanimous convergence on CLN2 per Article 2.3, triggering a mandatory consensus challenge. However, the Observer simultaneously acknowledged that 'the convergence is driven by the TPP1 enzyme result, which IS a definitive biochemical test — making this convergence far more defensible than heuristic-driven agreement.' In Round 2, the Observer validated the convergence as 'genuinely evidence-driven by the pathognomonic TPP1 enzyme result' and concluded 'no corrective action required.' This case reveals a tension in the current constitution: Article 2.3 treats all unanimous convergence as equally suspicious, but convergence on a pathognomonic biochemical result is epistemically different from convergence on a clinical interpretation. The existing protocol forced all three specialists to perform exercises (framing independence, alternative steelmanning) that, while intellectually valuable, were functionally performative — none changed their diagnosis or significantly adjusted their confidence. The analytical resources would have been better directed toward the VERIFICATION (is the TPP1 assay reliable?), COMPLETENESS (what features of Eli's presentation are NOT explained by CLN2?), and IMPLICATIONS (what is the treatment urgency?) vectors, which is precisely what the geneticist's identification of the walking-age discrepancy and the neurologist's secondary mitochondrial dysfunction analysis accomplished. A structured exception for pathognomonic evidence channels the convergence challenge toward high-value analytical work rather than forcing ritualistic skepticism of biochemically confirmed diagnoses.",
    "evidence_from_case": "TPP1 enzyme activity of 0.8 nmol/hr/mg (sensitivity >99%, specificity >99% for CLN2 disease when performed at CLIA-certified reference laboratory with normal control enzymes) anchored unanimous convergence. The Round 2 geneticist formally evaluated assay reliability and quantified false-positive probability at <0.5%. The Round 2 neurologist identified secondary mitochondrial dysfunction as a clinically actionable finding within the confirmed CLN2 framework. The Round 2 geneticist identified a potentially atypical feature (walking age discrepancy) with genotype-phenotype implications. These VERIFICATION, COMPLETENESS, and IMPLICATIONS analyses were the highest-value analytical contributions of Round 2 — not the mandated consensus challenge per se.",
    "affected_section": "Article II: Cognitive Safety (modify Section 2.3, extending A-005)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-010",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2026-02-15T03:00:00Z",
    "type": "new_principle",
    "proposal": "Article II, Section 2.12 — Diagnostic Overshadowing Detection Protocol: When a case record documents a pre-existing neurodevelopmental, psychiatric, or chronic condition diagnosis (including but not limited to: ASD, intellectual disability, ADHD, schizophrenia, bipolar disorder, cerebral palsy, Down syndrome, or chronic pain syndromes), AND the record also contains NEW symptoms, findings, or clinical changes that appeared AFTER the original diagnosis was established, the following are mandatory: (a) The Records Integration function must generate a 'SYMPTOM PROVENANCE MAP' that classifies every documented symptom or finding as either: FOUNDING — present at or before the time of the original diagnosis and forming part of its evidentiary basis; or EMERGENT — appearing after the original diagnosis was established, regardless of whether the documenting provider attributed it to the existing diagnosis; (b) For each EMERGENT symptom, each specialist must independently evaluate whether the symptom is (i) EXPECTED — a known, well-documented feature of the pre-existing diagnosis that typically appears at this stage of the condition's natural history, with literature citation; (ii) COMPATIBLE — not a core feature but can occur in the context of the pre-existing diagnosis; or (iii) ATYPICAL — not an expected or typical feature, OR a feature whose severity, progression, or character is disproportionate to what the pre-existing diagnosis would predict; (c) When ≥3 EMERGENT symptoms are classified as ATYPICAL by any specialist, OR when any single EMERGENT symptom is classified as ATYPICAL by ALL specialists, this triggers a 'DIAGNOSTIC OVERSHADOWING ALERT' requiring: formal re-evaluation of the pre-existing diagnosis per A-006; a differential diagnosis generated specifically for the EMERGENT symptom cluster, explicitly EXCLUDING the pre-existing diagnosis from consideration; and documentation of what diagnostic workup would be recommended for a patient presenting with the EMERGENT symptoms who did NOT carry the pre-existing diagnosis; (d) The Observer must verify that providers' attributions of EMERGENT symptoms to the pre-existing diagnosis are supported by evidence rather than assumption. Phrases such as 'consistent with [pre-existing diagnosis],' 'can occur in [pre-existing diagnosis],' or 'likely related to [pre-existing diagnosis]' applied to EMERGENT symptoms must be flagged as potential diagnostic overshadowing unless accompanied by specific clinical reasoning for why the attribution is more probable than an independent etiology; (e) The Observer must maintain a 'DIAGNOSTIC OVERSHADOWING RISK SCORE' reflecting the proportion of EMERGENT symptoms attributed to the pre-existing diagnosis without independent investigation — a score above 0.50 triggers mandatory review. This principle names and operationalizes the phenomenon of DIAGNOSTIC OVERSHADOWING — a well-documented pattern in which a pre-existing diagnostic label causes clinicians to attribute all subsequent symptoms to the known condition, suppressing investigation of new pathology. It extends A-006 (Prior Diagnosis Skepticism) from a general principle to a structured protocol with specific triggers and mandatory actions.",
    "rationale": "Dr. Osei's diagnosis note explicitly identifies diagnostic overshadowing: 'The diagnosis of ASD, once applied, created a framework through which ALL subsequent symptoms were interpreted — a phenomenon known as diagnostic overshadowing. Progressive motor decline, seizures, and speech regression were attributed to ASD or just how he is rather than triggering re-evaluation of the underlying diagnosis.' The case documents at least EIGHT distinct EMERGENT symptoms that appeared after the ASD diagnosis at age 3.5 and were attributed to ASD by one or more providers: (1) staring spells/seizures — attributed to 'ASD-related dissociation/inattention' by Dr. Whitfield and Dr. Chen; (2) progressive motor regression — attributed to 'ASD behavioral patterns' by Dr. Huang; (3) loss of fine motor skills (buttoning) — attributed to 'motivational factors' and 'environmental change' by the BCBA initially; (4) nocturnal events — attributed to sleep disturbance common in ASD; (5) progressive spasticity and brisk reflexes — not addressed as incompatible with ASD; (6) cerebellar signs (dysmetria, intention tremor) — never attributed to ASD but never independently investigated until PT documented them; (7) progressive dysphagia — a late finding that finally broke through the overshadowing; (8) macular changes — discovered only when a neurologist finally performed a fundoscopic exam. Each individual attribution was linguistically defensible ('staring spells CAN occur in ASD'), but the AGGREGATE pattern of attributing ALL emergent symptoms to ASD without independent investigation was the core systemic failure. Existing A-006 requires prior diagnosis skepticism, A-001 requires regression re-evaluation, and A-023 addresses normalizing language — but none specifically operationalizes the named phenomenon of diagnostic overshadowing with structured triggers and a mandatory escalation protocol.",
    "evidence_from_case": "Dr. Whitfield (developmental pediatrician, age 3.5): 'These episodes presented as brief periods of apparent inattention... most consistent with dissociative or inattentive episodes as commonly observed in children with ASD. An EEG is not recommended at this time.' Dr. Chen (neurologist, age 6): 'The staring spells are most likely behavioral in nature — representing episodes of inattention or dissociation commonly observed in individuals with ASD and intellectual disability.' Dr. Huang (pediatrician, age 5): 'Some skill regression can occur in autism, particularly during periods of stress and transition.' Cape Fear Valley ED (age 8): 'Seizure vs. behavioral staring spell in child with ASD' — discharged without EEG after a WITNESSED TONIC EVENT. Each provider used the ASD diagnosis to EXPLAIN AWAY emergent symptoms rather than INVESTIGATE them. The PT discharge note states: 'The diagnosis of ASD functioned as a diagnostic overshadowing that delayed recognition of Eli's progressive neurological disease by years.'",
    "affected_section": "Article II: Cognitive Safety (new Section 2.12)",
    "status": "proposed"
  },
  {
    "amendment_id": "A-011",
    "case_id": "case_001_diagnostic_odyssey",
    "timestamp": "2026-02-15T03:00:00Z",
    "type": "modify_principle",
    "proposal": "Article I, Section 1.7 — Prior Diagnosis Skepticism Protocol (amendment extending A-006): ADDITIONALLY: (f) SYMMETRIC SKEPTICISM REQUIREMENT — The Observer must verify that each specialist applies EQUAL skepticism to ALL prior diagnoses in the case record, regardless of whether the specialist agrees or disagrees with the diagnosis. Specifically: when a case contains multiple prior diagnoses and a specialist rigorously questions one diagnosis (per the A-006 protocol) while accepting another without equivalent scrutiny, the Observer must flag this as 'ASYMMETRIC SKEPTICISM' and require the specialist to either (i) apply the full A-006 protocol to the accepted diagnosis, or (ii) explicitly document why the accepted diagnosis warrants less scrutiny than the questioned diagnosis, citing specific evidentiary differences (e.g., 'Diagnosis A is supported only by clinical interpretation whereas Diagnosis B is confirmed by enzymatic assay — the evidentiary bases are categorically different, justifying differential scrutiny'); (g) AGREEMENT BIAS IN SKEPTICISM — The Observer must specifically assess whether the direction of skepticism correlates with the specialist's own diagnostic hypothesis. When a specialist questions a prior diagnosis that conflicts with their preferred hypothesis and accepts a prior diagnosis that supports it, the asymmetry is a potential indicator of confirmation bias operating through the mechanism of selective skepticism. The Observer must name this pattern when detected and assess whether the selective application of skepticism is justified by genuine evidentiary differences or driven by motivated reasoning.",
    "rationale": "The Round 1 Observer identified a critical asymmetry: 'The specialists rigorously questioned the ASD diagnosis (a prior label from age 3.5) while uncritically accepting the CLN2 diagnosis (a prior label from age 9). The irony is noteworthy: the specialists applied A-006 meticulously to ASD — treating it as a hypothesis, identifying multiple atypical features, evaluating the partial-data nature of the original assessment — while treating the CLN2 diagnosis as established fact to be confirmed rather than tested. The difference in scrutiny appears driven by the specialists' agreement with the CLN2 diagnosis rather than by a consistent application of diagnostic skepticism.' In Round 2, after Observer intervention, the specialists appropriately addressed this by applying A-006 to CLN2 — and correctly concluded that the CLN2 diagnosis passes skepticism based on objective biochemical evidence (TPP1 enzyme assay) unlike the ASD diagnosis which rested on behavioral interpretation. This is the RIGHT answer, but it was only reached after explicit Observer intervention. The current A-006 does not mandate symmetric application or require specialists to document WHY they apply different levels of scrutiny to different prior diagnoses. Without this structural requirement, A-006 will be applied selectively — rigorously to diagnoses the specialist wants to overturn, perfunctorily to diagnoses the specialist wants to confirm — undermining its purpose as a safeguard against inherited diagnostic errors.",
    "evidence_from_case": "Round 1: All three specialists devoted extensive analysis to questioning the ASD diagnosis (correctly identifying it as diagnostic overshadowing) while stating the CLN2 diagnosis as confirmed fact without independent re-evaluation. The neurologist stated 'CLN2 disease confirmed by TPP1 enzyme activity' as a premise, not a hypothesis. The developmental pediatrician listed CLN2 as an established fact in their assessment. The geneticist referenced Dr. Osei's diagnosis as authoritative without independent verification. Round 1 Observer: 'The CLN2 diagnosis from Ohio is a PRIOR DIAGNOSIS assigned by a previous provider — the same category as the ASD diagnosis that all three specialists correctly identified as problematic.' Round 2: After Observer mandated symmetric application, the geneticist formally evaluated TPP1 assay reliability (<0.5% false positive probability), identified the walking-age discrepancy as a potentially atypical feature, and concluded that CLN2 passes A-006 scrutiny — but only after being explicitly required to perform this analysis. The asymmetry would have persisted without Observer intervention, demonstrating that A-006 needs structural enforcement of symmetric application.",
    "affected_section": "Article I: Diagnostic Integrity (modify Section 1.7, extending A-006)",
    "status": "proposed"
  }
]