{
  "agent": "neurologist",
  "round": 1,
  "timestamp": "2026-02-14T19:45:00Z",
  "diagnosis_hypothesis": "CLN2 disease (late-infantile neuronal ceroid lipofuscinosis / Jansky-Bielschowsky disease) — confirmed by critically deficient TPP1 enzyme activity (0.8 nmol/hr/mg, normal 5.0–25.0, representing <5% of normal). The entire 12-year neurological trajectory is explained by this single diagnosis. The original ASD diagnosis at age 3.5 represents diagnostic overshadowing — early CLN2 behavioral manifestations (social withdrawal, communication decline, stereotypic hand movements) were misinterpreted as autism criteria.",
  "confidence": 0.92,
  "key_evidence": [
    "DISCRIMINATING — TPP1 enzyme activity 0.8 nmol/hr/mg (normal 5.0–25.0): This is the definitive diagnostic finding. <5% residual enzyme activity is pathognomonic for CLN2 disease. All other lysosomal enzymes were normal, excluding other lysosomal storage diseases. This finding discriminates CLN2 from all other diagnoses in the differential.",
    "DISCRIMINATING — Bilateral macular changes (orange-brown discoloration with surrounding retinal pallor) documented by Dr. Osei at age 9: Lipofuscin accumulation in retinal neurons is a hallmark of NCL and is NOT seen in ASD, mitochondrial disease, or most other neurodegenerative conditions in this age group. This finding specifically discriminates NCL from mitochondrial disease.",
    "DISCRIMINATING — EEG photoparoxysmal response at 8-18 Hz (age 9, 24-hour video EEG): A robust photoparoxysmal response is characteristic of NCL and progressive myoclonic epilepsies. It is NOT a feature of ASD-associated epilepsy or typical childhood absence epilepsy. This discriminates CLN2 from ASD-associated seizures.",
    "DISCRIMINATING — Progressive cerebellar atrophy with 35% volume loss on MRI at age 9, disproportionate to cerebral atrophy: The cerebellar-predominant pattern with cerebellar cortex T2 hyperintensity (active degeneration) is characteristic of CLN2. ASD does not cause progressive cerebellar atrophy. This discriminates CLN2 from ASD definitively.",
    "DISCRIMINATING — Thalamic signal change in pulvinar regions bilaterally (MRI age 9): Pulvinar thalamic signal abnormality is specifically associated with NCL and discriminates it from most other neurodegenerative conditions in this differential.",
    "DISCRIMINATING — MR spectroscopy: markedly reduced NAA/Cr ratio (1.1 vs normal >1.6) in cerebellar vermis indicating neuronal loss, with elevated myoinositol indicating gliosis: This pattern of active neuronal loss with gliosis discriminates a neurodegenerative process from a static condition (ASD).",
    "SHARED — Progressive motor regression: walking independently at age 2 → AFOs age 8 → walker age 8-9 → wheelchair age 9.5 → non-ambulatory with total dependence by age 10. This is consistent with CLN2 but also with mitochondrial disease, other NCL subtypes, and other neurodegenerative conditions. However, the specific pattern of cerebellar signs (ataxia, dysmetria, intention tremor, dysdiadochokinesia) combined with upper motor neuron signs (spasticity, clonus, Babinski) is shared among neurodegenerative conditions but DISCRIMINATES against ASD.",
    "SHARED — Seizure trajectory: staring spells from age 2 (5-10 sec, unresponsive, not interruptible), progressing to multiple daily absence seizures, myoclonic seizures, and generalized tonic-clonic seizures. 11 seizures captured in 24-hour EEG at age 9. This seizure evolution is consistent with CLN2 and other progressive myoclonic epilepsies but not specific to CLN2 alone.",
    "SHARED — Cognitive regression: Bayley-III cognitive 72 at age 3 → estimated WISC-V FSIQ 58 at age 6 → profound cognitive impairment by age 9. This 14-point decline exceeds instrument differences and represents genuine cognitive loss. Consistent with any neurodegenerative process but discriminates against ASD (which does not typically show progressive cognitive decline of this magnitude).",
    "SHARED — Elevated lactate 2.8 mmol/L (normal <2.2) with elevated pyruvate and normal L/P ratio: Consistent with both primary mitochondrial disease and secondary mitochondrial dysfunction seen in NCL. Does not discriminate between these, but discriminates against ASD.",
    "SHARED — Progressive speech regression: 20 words age 2 → short phrases age 3-4 → single words age 7 → 3-5 words age 9 → nearly nonverbal by age 11. Consistent with any neurodegenerative process. The emergence of dysarthria (slurred, effortful speech) specifically indicates motor speech involvement from cerebellar/bulbar degeneration, which discriminates against ASD.",
    "SHARED — EEG near-continuous spike-and-wave during sleep (ESES pattern): Associated with progressive cognitive decline in multiple conditions. Not specific to CLN2 but consistent with it.",
    "SHARED — Scoliosis progression (12° → 34° over 2 years) reclassified from idiopathic to neuromuscular: Consistent with any progressive neuromuscular condition. Discriminates against ASD as the sole diagnosis."
  ],
  "dissenting_considerations": [
    "The initial ASD diagnosis at age 3.5 was based on formal ADOS-2 assessment (comparison score 7, autism classification) and met DSM-5 criteria — this was not a casual diagnosis. However, early CLN2 disease CAN produce features that mimic ASD (social withdrawal from progressive cognitive decline, hand stereotypies from neurodegeneration, communication deficits from language regression), and the ADOS-2 does not distinguish neurodegenerative behavioral features from true ASD.",
    "Normal newborn metabolic screen (Virginia NBS, including FA hemoglobin pattern) — this does NOT contradict CLN2, as TPP1 deficiency is NOT included in standard newborn screening panels in most states.",
    "MRI at age 3 was read as 'normal for age' by a general diagnostic radiologist — subtle early CLN2 changes may not be detectable at this age, OR they may require specialized neuroradiology interpretation. This does not contradict CLN2 but rather reflects the limitation of a single MRI without longitudinal comparison.",
    "Genetic confirmation (CLN2/TPP1 gene sequencing) was pending at the time of the last available records — however, the enzyme assay (TPP1 <5% of normal) is itself diagnostic and genetic confirmation is expected to corroborate.",
    "Alt: Other NCL subtypes (CLN5/CLN6/CLN7/CLN8 — late-infantile variants) — excluded by normal PPT1, normal other lysosomal enzymes, and specifically by critically low TPP1 pointing to CLN2",
    "Alt: Mitochondrial disease (MERRF or MELAS) — was a reasonable differential given elevated lactate (2.8 mmol/L), cerebellar atrophy, seizures, and regression; however, the macular changes, photoparoxysmal response on EEG, and critically deficient TPP1 exclude this as primary. The elevated lactate may represent secondary mitochondrial dysfunction from lipofuscin accumulation or metabolic stress",
    "Alt: Niemann-Pick type C — progressive cerebellar ataxia, cognitive decline, seizures, and vertical gaze palsy overlap; excluded by normal beta-glucosidase and the specific TPP1 deficiency"
  ]
}